// 9
let number = 17;

if (number > 2) {
  for (let i = 2; i < number; i++) {
    if (number % i === 0) {
      console.log(`არ არის მარტივი`);
    } else {
      console.log(`მარტივია`);
    }
    continue;
  }
} else if (number == 2) {
  console.log(`მარტივი რიცხვია`);
} else if (number == 1) {
  console.log(`არ არის მარტივი`);
} else {
  console.log(`უარყოფითს ნუ წერ`);
}

// იმ ვარიანტზეც გავწერე ვინმე 2ზე დაბალ რიცხვს თუ გამოიყენებს.
// პრაქტიკული არ არის რადგან ყველა i-ს მნიშვნელობაზე ყოფს და თვითოეულ განაყოფზე ცალცალკე წერს პასუხს.
// თუ ერთ განაყოფზე მაინც დაწერა „არ არის მარტივი„ ანუ number არ არის მარტივი.
